RhinoInside.Revit API Documentation
GeometryEncoder.ToArc Method (Circle)
 Converts the specified Rhino.Geometry.Circle to an equivalent of Autodesk.Revit.DB.Arc.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Autodesk.Revit.DB.Arc ToArc(
	this Rhino.Geometry.Circle circle
)
@staticmethod
def ToArc(
	circle: Rhino.Geometry.Circle
) -> Autodesk.Revit.DB.Arc
Parameters
circle
Type: Rhino.Geometry.Circle
Rhino circle to convert.
Return Value
Type: Autodesk.Revit.DB.Arc
Revit arc that is equivalent to the provided Rhino circle.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Circle. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToArc(Circle) as extension method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.Arc revitArc = rhinoCircle.ToArc();
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry
6clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
7
8revit_arc: DB.Arc = rhino_circle.ToArc()
 Using ToArc(Circle) as static method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.Arc revitArc = GeometryEncoder.ToArc(rhinoCircle);
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as ge
6
7revit_arc: DB.Arc = ge.ToArc(rhino_circle)
See Also
Reference
GeometryEncoder Class
ToArc Overload
RhinoInside.Revit.Convert.Geometry Namespace